GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_spi.c
/*
 * Copyright (c) 2006-2026, RT-Thread Development Team
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Change Logs:
 * Date           Author       Notes
 * 2021-12-20     BruceOu      first implementation
 */
#include "drv_spi.h"

#ifdef RT_USING_SPI

/* GD32M53x has different SPI API, SPI driver needs adaptation */
#if defined(SOC_SERIES_GD32M53x)
#include "gd32m53x_spi.h"

#define SPI0                            SPI
#define RCU_SPI0                        RCU_SPI

#define spi_i2s_flag_get(periph, flag)          spi_flag_get(flag)
#define spi_i2s_data_transmit(periph, data)     spi_data_transmit(data)
#define spi_i2s_data_receive(periph)            spi_data_receive()
#define spi_crc_off(periph)                     spi_crc_off()
#define spi_init(periph, init_struct)           spi_init(init_struct)
#define spi_enable(periph)                      spi_enable()
#define spi_disable(periph)                     spi_disable()

#endif /* SOC_SERIES_GD32M53x */

#if defined(BSP_USING_SPI0) || defined(BSP_USING_SPI1) || defined(BSP_USING_SPI2) || defined(BSP_USING_SPI3) || defined(BSP_USING_SPI4) || defined(BSP_USING_SPI5)
#define LOG_TAG              "drv.spi"

#include <rtdbg.h>

#ifdef BSP_USING_SPI0
static struct rt_spi_bus spi_bus0;
#endif
#ifdef BSP_USING_SPI1
static struct rt_spi_bus spi_bus1;
#endif
#ifdef BSP_USING_SPI2
static struct rt_spi_bus spi_bus2;
#endif
#ifdef BSP_USING_SPI3
static struct rt_spi_bus spi_bus3;
#endif
#ifdef BSP_USING_SPI4
static struct rt_spi_bus spi_bus4;
#endif
#ifdef BSP_USING_SPI5
static struct rt_spi_bus spi_bus5;
#endif

#if !defined(SOC_SERIES_GD32H75E) && !defined(SOC_SERIES_GD32E51x) && !defined(SOC_SERIES_GD32F3x0) \
 && !defined(SOC_SERIES_GD32F50x) && !defined(SOC_SERIES_GD32G5x3) && !defined(SOC_SERIES_GD32C11x) \
 && !defined(SOC_SERIES_GD32L23x) && !defined(SOC_SERIES_GD32E11x) && !defined(SOC_SERIES_GD32H77x) \
 && !defined(SOC_SERIES_GD32H7xx) && !defined(SOC_SERIES_GD32F5xx)

static const struct gd32_spi spi_bus_obj[] = {

#ifdef BSP_USING_SPI0
    {
        SPI0,
        "spi0",
        RCU_SPI0,
        RCU_GPIOA,
        RCU_GPIOA,
        RCU_GPIOA,
        &spi_bus0,
        GPIOA,
        GPIOA,
        GPIOA,
#if defined (SOC_SERIES_GD32F4xx) || defined (SOC_SERIES_GD32H7xx) || (defined SOC_SERIES_GD32F5xx)
        GPIO_AF_5,
#endif
#if defined (SOC_SERIES_GD32E23x)
        GPIO_AF_0,
#endif
        GPIO_PIN_5,
        GPIO_PIN_6,
        GPIO_PIN_7,
    },
#endif /* BSP_USING_SPI0 */

#ifdef BSP_USING_SPI1
    {
        SPI1,
        "spi1",
        RCU_SPI1,
        RCU_GPIOB,
        RCU_GPIOB,
        RCU_GPIOB,
        &spi_bus1,
        GPIOB,
        GPIOB,
        GPIOB,
#if defined (SOC_SERIES_GD32F4xx) || defined (SOC_SERIES_GD32H7xx) || (defined SOC_SERIES_GD32F5xx)
        GPIO_AF_5,
#endif
#if defined SOC_SERIES_GD32E23x
        GPIO_AF_0,
#endif

        GPIO_PIN_13,
        GPIO_PIN_14,
        GPIO_PIN_15,
    },
#endif /* BSP_USING_SPI1 */

#ifdef BSP_USING_SPI2
    {
        SPI2,
        "spi2",
        RCU_SPI2,
        RCU_GPIOB,
        RCU_GPIOB,
        RCU_GPIOB,
        &spi_bus2,
        GPIOB,
        GPIOB,
        GPIOB,
#if defined (SOC_SERIES_GD32F4xx) || defined (SOC_SERIES_GD32H7xx) || (defined SOC_SERIES_GD32F5xx)
        GPIO_AF_6,
#endif
        GPIO_PIN_3,
        GPIO_PIN_4,
        GPIO_PIN_5,
    },
#endif /* BSP_USING_SPI2 */

#ifdef BSP_USING_SPI3
    {
        SPI3,
        "spi3",
        RCU_SPI3,
        RCU_GPIOE,
        RCU_GPIOE,
        RCU_GPIOE,
        &spi_bus3,
        GPIOE,
        GPIOE,
        GPIOE,
#if defined (SOC_SERIES_GD32F4xx) || defined (SOC_SERIES_GD32H7xx) || (defined SOC_SERIES_GD32F5xx)
        GPIO_AF_5,
#endif
        GPIO_PIN_2,
        GPIO_PIN_5,
        GPIO_PIN_6,
    },
#endif /* BSP_USING_SPI3 */

#ifdef BSP_USING_SPI4
    {
        SPI4,
        "spi4",
        RCU_SPI4,
        RCU_GPIOF,
        RCU_GPIOF,
        RCU_GPIOF,
        &spi_bus4,
        GPIOF,
        GPIOF,
        GPIOF,
#if defined (SOC_SERIES_GD32F4xx) || defined (SOC_SERIES_GD32H7xx) || (defined SOC_SERIES_GD32F5xx)
        GPIO_AF_5,
#endif
        GPIO_PIN_7,
        GPIO_PIN_8,
        GPIO_PIN_9,

    },
#endif /* BSP_USING_SPI4 */

#ifdef BSP_USING_SPI5
    {
        SPI5,
        "spi5",
        RCU_SPI5,
        RCU_GPIOG,
        RCU_GPIOG,

        RCU_GPIOG,
        &spi_bus5,
        GPIOG,
        GPIOG,
        GPIOG,
#if defined (SOC_SERIES_GD32F4xx) || defined (SOC_SERIES_GD32H7xx) || (defined SOC_SERIES_GD32F5xx)
        GPIO_AF_5,
#endif
        GPIO_PIN_13,
        GPIO_PIN_12,
        GPIO_PIN_14,
    }
#endif /* BSP_USING_SPI5 */
};

#else

/* Static DMA configurations - safer than compound literals for IAR/older compilers */
#ifdef BSP_SPI0_USING_DMA
static struct dma_config spi0_dma_tx_cfg = SPI0_TX_DMA_CONFIG;
static struct dma_config spi0_dma_rx_cfg = SPI0_RX_DMA_CONFIG;
#endif
#ifdef BSP_SPI1_USING_DMA
static struct dma_config spi1_dma_tx_cfg = SPI1_TX_DMA_CONFIG;
static struct dma_config spi1_dma_rx_cfg = SPI1_RX_DMA_CONFIG;
#endif
#ifdef BSP_SPI2_USING_DMA
static struct dma_config spi2_dma_tx_cfg = SPI2_TX_DMA_CONFIG;
static struct dma_config spi2_dma_rx_cfg = SPI2_RX_DMA_CONFIG;
#endif
#ifdef BSP_SPI3_USING_DMA
static struct dma_config spi3_dma_tx_cfg = SPI3_TX_DMA_CONFIG;
static struct dma_config spi3_dma_rx_cfg = SPI3_RX_DMA_CONFIG;
#endif
#ifdef BSP_SPI4_USING_DMA
static struct dma_config spi4_dma_tx_cfg = SPI4_TX_DMA_CONFIG;
static struct dma_config spi4_dma_rx_cfg = SPI4_RX_DMA_CONFIG;
#endif
#ifdef BSP_SPI5_USING_DMA
static struct dma_config spi5_dma_tx_cfg = SPI5_TX_DMA_CONFIG;
static struct dma_config spi5_dma_rx_cfg = SPI5_RX_DMA_CONFIG;
#endif

static struct gd32_spi spi_bus_obj[] = {

#ifdef BSP_USING_SPI0
    {
        .spi_periph = SPI0,
        .spi_clk = RCU_SPI0,
        .irqn = SPI0_IRQn,
        .bus_name = "spi0",
        .spi_bus = &spi_bus0,
    },
#endif /* BSP_USING_SPI0 */

#ifdef BSP_USING_SPI1
    {
        .spi_periph = SPI1,
        .spi_clk = RCU_SPI1,
#if defined(SOC_SERIES_GD32E51x)
        .irqn = SPI1_I2S1ADD_IRQn,
#else
        .irqn = SPI1_IRQn,
#endif
        .bus_name = "spi1",
        .spi_bus = &spi_bus1,
    },
#endif /* BSP_USING_SPI1 */

#ifdef BSP_USING_SPI2
    {
        .spi_periph = SPI2,
        .spi_clk = RCU_SPI2,
#if defined(SOC_SERIES_GD32E51x)
        .irqn = SPI2_I2S2ADD_IRQn,
#else
        .irqn = SPI2_IRQn,
#endif
        .bus_name = "spi2",
        .spi_bus = &spi_bus2,
    },
#endif /* BSP_USING_SPI2 */

#ifdef BSP_USING_SPI3
    {
        .spi_periph = SPI3,
        .spi_clk = RCU_SPI3,
        .irqn = SPI3_IRQn,
        .bus_name = "spi3",
        .spi_bus = &spi_bus3,
    },
#endif /* BSP_USING_SPI3 */

