GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_spi.c
    if (spi_device->dma_tx != RT_NULL)
    {
        dma_channel_disable(spi_device->dma_tx->periph, spi_device->dma_tx->channel);
        dma_flag_clear(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_FLAG_FTF);
        spi_dma_disable(spi_periph, SPI_DMA_TRANSMIT);
    }
}

/**
 * @brief Initialize SPI DMA configuration
 * @param spi_device: SPI device structure
 * @retval None
 */
static void gd32_spi_dma_config_init(struct gd32_spi *spi_device)
{
    if (spi_device == RT_NULL)
    {
        return;
    }
    
    /* Default to NULL */
    spi_device->dma_tx = RT_NULL;
    spi_device->dma_rx = RT_NULL;
    
#ifdef BSP_SPI0_USING_DMA
    if (spi_device->spi_periph == SPI0)
    {
        spi_device->dma_tx = &spi0_dma_tx_cfg;
        spi_device->dma_rx = &spi0_dma_rx_cfg;
    }
#endif
#ifdef BSP_SPI1_USING_DMA
    if (spi_device->spi_periph == SPI1)
    {
        spi_device->dma_tx = &spi1_dma_tx_cfg;
        spi_device->dma_rx = &spi1_dma_rx_cfg;
    }
#endif
#ifdef BSP_SPI2_USING_DMA
    if (spi_device->spi_periph == SPI2)
    {
        spi_device->dma_tx = &spi2_dma_tx_cfg;
        spi_device->dma_rx = &spi2_dma_rx_cfg;
    }
#endif
#ifdef BSP_SPI3_USING_DMA
    if (spi_device->spi_periph == SPI3)
    {
        spi_device->dma_tx = &spi3_dma_tx_cfg;
        spi_device->dma_rx = &spi3_dma_rx_cfg;
    }
#endif
#ifdef BSP_SPI4_USING_DMA
    if (spi_device->spi_periph == SPI4)
    {
        spi_device->dma_tx = &spi4_dma_tx_cfg;
        spi_device->dma_rx = &spi4_dma_rx_cfg;
    }
#endif
#ifdef BSP_SPI5_USING_DMA
    if (spi_device->spi_periph == SPI5)
    {
        spi_device->dma_tx = &spi5_dma_tx_cfg;
        spi_device->dma_rx = &spi5_dma_rx_cfg;
    }
#endif
}
#endif

static rt_err_t spi_configure(struct rt_spi_device* device,
                          struct rt_spi_configuration* configuration)
{
    struct rt_spi_bus * spi_bus = (struct rt_spi_bus *)device->bus;
    struct gd32_spi *spi_device = (struct gd32_spi *)spi_bus->parent.user_data;
    spi_parameter_struct spi_init_struct;
    uint32_t spi_periph = spi_device->spi_periph;

    RT_ASSERT(device != RT_NULL);
    RT_ASSERT(configuration != RT_NULL);

    /* Call board-level SPI GPIO initialization */
    gd32_spi_init(spi_device);
    
#if defined(BSP_USING_SPI_DMA)
    /* Call board-level DMA initialization if DMA is enabled */
    if (spi_device->dma_tx != RT_NULL || spi_device->dma_rx != RT_NULL)
    {
        gd32_spi_dma_init(spi_device);
    }
#endif

#if defined (SOC_SERIES_GD32H7xx) || defined (SOC_SERIES_GD32H75E) || defined (SOC_SERIES_GD32H77x)
    /* data_width */
    if(configuration->data_width >=4 && configuration->data_width <= 32)
    {
        spi_init_struct.data_size = CFG0_DZ(configuration->data_width - 1);
    }
    else
    {
        return -RT_EIO;
    }
#else
    /* data_width */
    if(configuration->data_width <= 8)
    {
        spi_init_struct.frame_size = SPI_FRAMESIZE_8BIT;
    }
    else if(configuration->data_width <= 16)
    {
        spi_init_struct.frame_size = SPI_FRAMESIZE_16BIT;
    }
    else
    {
        return -RT_EIO;
    }
#endif

    /* baudrate */
    {
        rcu_clock_freq_enum spi_src;
        uint32_t spi_apb_clock;
        uint32_t max_hz;

        max_hz = configuration->max_hz;

        LOG_D("sys   freq: %d\n", rcu_clock_freq_get(CK_SYS));
        LOG_D("CK_APB2 freq: %d\n", rcu_clock_freq_get(CK_APB2));
        LOG_D("max   freq: %d\n", max_hz);

        #if defined SOC_SERIES_GD32E23x || defined SOC_SERIES_GD32L23x || defined SOC_SERIES_GD32F3x0 \
         || defined SOC_SERIES_GD32M53x
        spi_src = spi_periph == SPI0? CK_APB2:CK_APB1;
        #else
        if (spi_periph == SPI1 || spi_periph == SPI2)
        {
            spi_src = CK_APB1;
        }
        else
        {
            spi_src = CK_APB2;
        }
        #endif
        spi_apb_clock = rcu_clock_freq_get(spi_src);

        if(max_hz >= spi_apb_clock/2)
        {
            spi_init_struct.prescale = SPI_PSC_2;
        }
        else if (max_hz >= spi_apb_clock/4)
        {
            spi_init_struct.prescale = SPI_PSC_4;
        }
        else if (max_hz >= spi_apb_clock/8)
        {
            spi_init_struct.prescale = SPI_PSC_8;
        }
        else if (max_hz >= spi_apb_clock/16)
        {
            spi_init_struct.prescale = SPI_PSC_16;
        }
        else if (max_hz >= spi_apb_clock/32)
        {
            spi_init_struct.prescale = SPI_PSC_32;
        }
        else if (max_hz >= spi_apb_clock/64)
        {
            spi_init_struct.prescale = SPI_PSC_64;
        }
        else if (max_hz >= spi_apb_clock/128)
        {
            spi_init_struct.prescale = SPI_PSC_128;
        }
        else
        {
            /*  min prescaler 256 */
            spi_init_struct.prescale = SPI_PSC_256;
        }
    } /* baudrate */

    switch(configuration->mode & RT_SPI_MODE_3)
    {
    case RT_SPI_MODE_0:
        spi_init_struct.clock_polarity_phase = SPI_CK_PL_LOW_PH_1EDGE;
        break;
    case RT_SPI_MODE_1:
        spi_init_struct.clock_polarity_phase = SPI_CK_PL_LOW_PH_2EDGE;
        break;
    case RT_SPI_MODE_2:
        spi_init_struct.clock_polarity_phase = SPI_CK_PL_HIGH_PH_1EDGE;
        break;
    case RT_SPI_MODE_3:
        spi_init_struct.clock_polarity_phase = SPI_CK_PL_HIGH_PH_2EDGE;
        break;
    }

    /* MSB or LSB */
    if(configuration->mode & RT_SPI_MSB)
    {
        spi_init_struct.endian = SPI_ENDIAN_MSB;
    }
    else
    {
        spi_init_struct.endian = SPI_ENDIAN_LSB;
    }

    spi_init_struct.trans_mode = SPI_TRANSMODE_FULLDUPLEX;
    spi_init_struct.device_mode = SPI_MASTER;
    spi_init_struct.nss = SPI_NSS_SOFT;
#if defined SOC_SERIES_GD32L23x
    spi_fifo_access_size_config(spi_periph, SPI_BYTE_ACCESS);
#endif
    spi_crc_off(spi_periph);

#if defined (SOC_SERIES_GD32H7xx) || defined (SOC_SERIES_GD32H75E) || defined (SOC_SERIES_GD32H77x)
    /* enable SPI byte access */
    spi_byte_access_enable(spi_periph);
    /* enable SPI NSS output */
    spi_nss_output_enable(spi_periph);
#elif defined (SOC_SERIES_GD32G5x3)
    /* enable SPI byte access */
    spi_fifo_access_size_config(spi_periph, SPI_BYTE_ACCESS);
    /* enable SPI NSS output */
    spi_nss_output_enable(spi_periph);
#endif

    /* init SPI */
    spi_init(spi_periph, &spi_init_struct);
    /* Enable SPI_MASTER */
    spi_enable(spi_periph);

