GD32-MCU-IOT/gd32_rt-thread/bsp/gd32/arm/libraries/gd32_drivers/drv_spi.c
    return RT_EOK;
}

static rt_ssize_t spixfer(struct rt_spi_device* device, struct rt_spi_message* message)
{
    struct rt_spi_bus * gd32_spi_bus = (struct rt_spi_bus *)device->bus;
    struct gd32_spi *spi_device = (struct gd32_spi *)gd32_spi_bus->parent.user_data;
    struct rt_spi_configuration * config = &device->config;
    uint32_t spi_periph = spi_device->spi_periph;

    RT_ASSERT(device != NULL);
    RT_ASSERT(message != NULL);

    /* take CS */
    if (message->cs_take && !(device->config.mode & RT_SPI_NO_CS) && (device->cs_pin != PIN_NONE))
    {
        if (device->config.mode & RT_SPI_CS_HIGH)
        {
            rt_pin_write(device->cs_pin, PIN_HIGH);
        }
        else
        {
            rt_pin_write(device->cs_pin, PIN_LOW);
        }
    }

    LOG_D("%s transfer prepare and start", spi_device->bus_name);
    LOG_D("%s sendbuf: %X, recvbuf: %X, length: %d",
          spi_device->bus_name,
          (uint32_t)message->send_buf,
          (uint32_t)message->recv_buf, message->length);

#if defined(BSP_USING_SPI_DMA)
    /* Use DMA for large transfers if enabled */
    if ((spi_device->dma_tx != RT_NULL || spi_device->dma_rx != RT_NULL)
        && message->length >= BSP_SPI_DMA_TRANS_MIN_LEN && config->data_width <= 8)
    {
        const rt_uint8_t * send_ptr = message->send_buf;
        rt_uint8_t * recv_ptr = message->recv_buf;
        rt_uint32_t size = message->length;
        
        /* Prepare dummy buffer for TX or RX only transfers */
        static rt_uint8_t dummy_tx = 0xFF;
        static rt_uint8_t dummy_rx = 0;
        
        LOG_D("spi DMA transfer start: %d", size);

#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || defined(SOC_SERIES_GD32H77x)
        /* H7xx requires setting the data frame number before DMA transfer */
        spi_current_data_num_config(spi_periph, size);
#endif

        /* DCache coherency: clean TX buffer so DMA reads correct data from RAM */
        if (send_ptr != RT_NULL)
        {
            rt_hw_cpu_dcache_ops(RT_HW_CACHE_FLUSH, (void *)send_ptr, size);
        }
        
        /* Configure RX DMA */
        if (spi_device->dma_rx != RT_NULL)
        {
            dma_channel_disable(spi_device->dma_rx->periph, spi_device->dma_rx->channel);
            
            if (recv_ptr != RT_NULL)
            {
                dma_memory_address_config(spi_device->dma_rx->periph, spi_device->dma_rx->channel, 
                                         DMA_MEMORY_0, (uint32_t)recv_ptr);
                dma_memory_address_generation_config(spi_device->dma_rx->periph, spi_device->dma_rx->channel, DMA_MEMORY_INCREASE_ENABLE);
            }
            else
            {
                dma_memory_address_config(spi_device->dma_rx->periph, spi_device->dma_rx->channel, 
                                         DMA_MEMORY_0, (uint32_t)&dummy_rx);
                dma_memory_address_generation_config(spi_device->dma_rx->periph, spi_device->dma_rx->channel, DMA_MEMORY_INCREASE_DISABLE);
            }
            
            dma_transfer_number_config(spi_device->dma_rx->periph, spi_device->dma_rx->channel, size);
            dma_interrupt_enable(spi_device->dma_rx->periph, spi_device->dma_rx->channel, DMA_CHXCTL_FTFIE);
            dma_channel_enable(spi_device->dma_rx->periph, spi_device->dma_rx->channel);
            spi_dma_enable(spi_periph, SPI_DMA_RECEIVE);
        }
        
        /* Configure TX DMA */
        if (spi_device->dma_tx != RT_NULL)
        {
            dma_channel_disable(spi_device->dma_tx->periph, spi_device->dma_tx->channel);
            
            if (send_ptr != RT_NULL)
            {
                dma_memory_address_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, 
                                         DMA_MEMORY_0, (uint32_t)send_ptr);
                dma_memory_address_generation_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_MEMORY_INCREASE_ENABLE);
            }
            else
            {
                dma_memory_address_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, 
                                         DMA_MEMORY_0, (uint32_t)&dummy_tx);
                dma_memory_address_generation_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_MEMORY_INCREASE_DISABLE);
            }
            
            dma_transfer_number_config(spi_device->dma_tx->periph, spi_device->dma_tx->channel, size);
            dma_interrupt_enable(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_CHXCTL_FTFIE);
            dma_channel_enable(spi_device->dma_tx->periph, spi_device->dma_tx->channel);
            spi_dma_enable(spi_periph, SPI_DMA_TRANSMIT);
        }

#if defined(SOC_SERIES_GD32H7xx) || defined(SOC_SERIES_GD32H75E) || defined(SOC_SERIES_GD32H77x)
        /* H7xx requires explicit master transfer start */
        spi_master_transfer_start(spi_periph, SPI_TRANS_START);
#endif
        
        /* Wait for transfer complete with timeout */
        rt_tick_t timeout = rt_tick_from_millisecond(BSP_SPI_DMA_TIMEOUT);
        rt_tick_t start = rt_tick_get();
        
        while (1)
        {
            rt_bool_t tx_done = RT_TRUE;
            rt_bool_t rx_done = RT_TRUE;
            
            if (spi_device->dma_tx != RT_NULL)
            {
                tx_done = (dma_flag_get(spi_device->dma_tx->periph, spi_device->dma_tx->channel, DMA_FLAG_FTF) == SET);
            }
            
            if (spi_device->dma_rx != RT_NULL)
            {
                rx_done = (dma_flag_get(spi_device->dma_rx->periph, spi_device->dma_rx->channel, DMA_FLAG_FTF) == SET);
            }
            
            if (tx_done && rx_done)
            {
                break;
            }
            
            if (rt_tick_get() - start > timeout)
            {
				LOG_E("%s DMA transfer timeout", spi_device->bus_name);
                gd32_spi_dma_cleanup(spi_device, spi_periph);
                return -RT_EIO;
            }
            
